print("--------12月份各类服饰销售情况--------")
print("日期    服装名称    价格/件    库存数量    销售量/每日")
print("1号    羽绒服    253.6    500    10")
print("2号    牛仔裤    86.3    600    60")
print("3号    风衣    96.8    335    43")
print("4号    皮草    135.9    855    63")
print("5号    T恤    65.8    632    63")
print("6号    衬衫    49.3    562    120")
print("7号    牛仔裤    86.3    600    72")
print("8号    羽绒服    253.6    500    69")
print("9号    牛仔裤    86.3    600    35")
print("10号    羽绒服    253.6    500    140")
print("11号    牛仔裤    86.3    600    90")
print("12号    皮草    135.9    855    24")
print("13号    T恤    65.8    632    63")
print("14号    风衣    96.8    335    25")
print("15号    牛仔裤    86.3    600    60")
print("16号    T恤    65.8    632    129")
print("17号    羽绒服    253.6    500    10")
print("18号    风衣    96.8    335    43")
print("19号    T恤    65.8    632    63")
print("20号    牛仔裤    86.3    600    60")
print("21号    皮草    135.9    855    63")
print("22号    风衣    96.8    335    60")
print("23号    T恤    65.8    632    58")
print("24号    牛仔裤    86.3    600    140")
print("25号    T恤    65.8    632    48")
print("26号    风衣    96.8    335    43")
print("27号    皮草    135.9    855    57")
print("28号    羽绒服    253.6    500    10")
print("29号    T恤    65.8    632    63")
print("30号    风衣    96.8    335    78")

sum1=("羽绒服")
sum2=("牛仔裤")
sum3=("风衣")
sum4=("皮草")
sum5=("T恤")
sum6=("衬衫")
j1=253.6
j2=86.3
j3=96.8
j4=135.9
j5=65.8
j6=49.3
l1=10+69+140+10+10
l2=72+35+90+60+60+140
l3=43+25+43+60+78
l4=63+24+63+57
l5=63+45+129+63+58+48+63
l6=120

zl=l1+l2+l3+l4+l5+l6

z1=j1*l1
z2=j2*l2
z3=j3*l3
z4=j4*l4
z5=j5*l5
z6=j6*l6
#           变量引用
#       str   分隔符   计算公式or变量
zsum=z1+z2+z3+z4+z5+z6
print("总销售额：",zsum)
print("所有服装平均每日销售数量：",(l1+l2+l3+l4+l5+l6)/30)
print(sum1,"平均每日销售数量：",l1/5)
print(sum2,"平均每日销售数量：",l2/7)
print(sum3,"平均每日销售数量：",l3/6)
print(sum4,"平均每日销售数量",l4/4)
print(sum5,"平均每日销售数量：",l5/7)
print(sum6,"平均每日销售数量：",l6/1)
print(sum1,":",l1/zl)
print(sum2,":",l2/zl)
print(sum3,":",l3/zl)
print(sum4,":",l4/zl)
print(sum5,":",l5/zl)
print(sum6,":",l6/zl)

